import codecs

alphabet={
'А':0,  'а':0,
'Б':1,  'б':1,
'В':2,  'в':2,
'Г':3,  'г':3,
'Д':4,  'д':4,
'Е':5,  'е':5,
'Ё':5,  'ё':5,
'Ж':6,  'ж':6,
'З':7,  'з':7,
'И':8,  'и':8,
'Й':9,  'й':9,
'К':10,  'к':10,
'Л':11,  'л':11,
'М':12,  'м':12,
'Н':13,  'н':13,
'О':14,  'о':14,
'П':15,  'п':15,
'Р':16,  'р':16,
'С':17,  'с':17,
'Т':18,  'т':18,
'У':19,  'у':19,
'Ф':20,  'ф':20,
'Х':21,  'х':21,
'Ц':22,  'ц':22,
'Ч':23,  'ч':23,
'Ш':24,  'ш':24,
'Щ':25,  'щ':25,
'Ы':27,  'ы':27,
'Ь':26,  'ь':26,
'Ъ':26,  'ъ':26,
'Э':28,  'э':28,
'Ю':29,  'ю':29,
'Я':30,  'я':30
}
alphabet_len=31

numbers={
0:'А',  
1:'Б',  
2:'В',  
3:'Г',  
4:'Д',  
5:'Е', 
6:'Ж',  
7:'З',  
8:'И',  
9:'Й',  
10:'К', 
11:'Л',  
12:'М',  
13:'Н',  
14:'О', 
15:'П', 
16:'Р',  
17:'С', 
18:'Т',  
19:'У',
20:'Ф', 
21:'Х', 
22:'Ц', 
23:'Ч', 
24:'Ш', 
25:'Щ', 
27:'Ы', 
26:'Ь', 
28:'Э', 
29:'Ю',
30:'Я'
}

def get_numbers_of_characters(string):
       global alphabet
       result=[]
       for char in string:
              if char in alphabet.keys():
                     result.append(alphabet[char])
       return result
def get_characters_of_numbers(arr):
       global numbers
       result=''
       for n in arr:
              if n in numbers.keys():
                     result+=numbers[n]
       return result
def num(char):
       if char in alphabet.keys():
              return alphabet[char]
       else:
              return -1
def char(num):
       if num in numbers.keys():
              return numbers[num]
       else:
              return -1


char_counts={
'А':0,
'Б':0,
'В':0,
'Г':0, 
'Д':0, 
'Е':0,
'Ж':0, 
'З':0, 
'И':0,
'Й':0, 
'К':0, 
'Л':0,
'М':0,
'Н':0, 
'О':0, 
'П':0,
'Р':0,
'С':0,
'Т':0,
'У':0,
'Ф':0,
'Х':0,
'Ц':0,
'Ч':0, 
'Ш':0,
'Щ':0,
'Ы':0,
'Ь':0,
'Э':0,
'Ю':0,
'Я':0
}
couple_counts={
'АА':0,'АБ':0,'АВ':0,'АГ':0,'АД':0,'АЕ':0,'АЖ':0,'АЗ':0,'АИ':0,'АЙ':0,'АК':0,'АЛ':0,'АМ':0,'АН':0,'АО':0,'АП':0,'АР':0,'АС':0,'АТ':0,'АУ':0,'АФ':0,'АХ':0,'АЦ':0,'АЧ':0,'АШ':0,'АЩ':0,'АЫ':0,'АЬ':0,'АЭ':0,'АЮ':0,'АЯ':0,'БА':0,'ББ':0,'БВ':0,'БГ':0,'БД':0,'БЕ':0,'БЖ':0,'БЗ':0,'БИ':0,'БЙ':0,'БК':0,'БЛ':0,'БМ':0,'БН':0,'БО':0,'БП':0,'БР':0,'БС':0,'БТ':0,'БУ':0,'БФ':0,'БХ':0,'БЦ':0,'БЧ':0,'БШ':0,'БЩ':0,'БЫ':0,'БЬ':0,'БЭ':0,'БЮ':0,'БЯ':0,'ВА':0,'ВБ':0,'ВВ':0,'ВГ':0,'ВД':0,'ВЕ':0,'ВЖ':0,'ВЗ':0,'ВИ':0,'ВЙ':0,'ВК':0,'ВЛ':0,'ВМ':0,'ВН':0,'ВО':0,'ВП':0,'ВР':0,'ВС':0,'ВТ':0,'ВУ':0,'ВФ':0,'ВХ':0,'ВЦ':0,'ВЧ':0,'ВШ':0,'ВЩ':0,'ВЫ':0,'ВЬ':0,'ВЭ':0,'ВЮ':0,'ВЯ':0,'ГА':0,'ГБ':0,'ГВ':0,'ГГ':0,'ГД':0,'ГЕ':0,'ГЖ':0,'ГЗ':0,'ГИ':0,'ГЙ':0,'ГК':0,'ГЛ':0,'ГМ':0,'ГН':0,'ГО':0,'ГП':0,'ГР':0,'ГС':0,'ГТ':0,'ГУ':0,'ГФ':0,'ГХ':0,'ГЦ':0,'ГЧ':0,'ГШ':0,'ГЩ':0,'ГЫ':0,'ГЬ':0,'ГЭ':0,'ГЮ':0,'ГЯ':0,'ДА':0,'ДБ':0,'ДВ':0,'ДГ':0,'ДД':0,'ДЕ':0,'ДЖ':0,'ДЗ':0,'ДИ':0,'ДЙ':0,'ДК':0,'ДЛ':0,'ДМ':0,'ДН':0,'ДО':0,'ДП':0,'ДР':0,'ДС':0,'ДТ':0,'ДУ':0,'ДФ':0,'ДХ':0,'ДЦ':0,'ДЧ':0,'ДШ':0,'ДЩ':0,'ДЫ':0,'ДЬ':0,'ДЭ':0,'ДЮ':0,'ДЯ':0,'ЕА':0,'ЕБ':0,'ЕВ':0,'ЕГ':0,'ЕД':0,'ЕЕ':0,'ЕЖ':0,'ЕЗ':0,'ЕИ':0,'ЕЙ':0,'ЕК':0,'ЕЛ':0,'ЕМ':0,'ЕН':0,'ЕО':0,'ЕП':0,'ЕР':0,'ЕС':0,'ЕТ':0,'ЕУ':0,'ЕФ':0,'ЕХ':0,'ЕЦ':0,'ЕЧ':0,'ЕШ':0,'ЕЩ':0,'ЕЫ':0,'ЕЬ':0,'ЕЭ':0,'ЕЮ':0,'ЕЯ':0,'ЖА':0,'ЖБ':0,'ЖВ':0,'ЖГ':0,'ЖД':0,'ЖЕ':0,'ЖЖ':0,'ЖЗ':0,'ЖИ':0,'ЖЙ':0,'ЖК':0,'ЖЛ':0,'ЖМ':0,'ЖН':0,'ЖО':0,'ЖП':0,'ЖР':0,'ЖС':0,'ЖТ':0,'ЖУ':0,'ЖФ':0,'ЖХ':0,'ЖЦ':0,'ЖЧ':0,'ЖШ':0,'ЖЩ':0,'ЖЫ':0,'ЖЬ':0,'ЖЭ':0,'ЖЮ':0,'ЖЯ':0,'ЗА':0,'ЗБ':0,'ЗВ':0,'ЗГ':0,'ЗД':0,'ЗЕ':0,'ЗЖ':0,'ЗЗ':0,'ЗИ':0,'ЗЙ':0,'ЗК':0,'ЗЛ':0,'ЗМ':0,'ЗН':0,'ЗО':0,'ЗП':0,'ЗР':0,'ЗС':0,'ЗТ':0,'ЗУ':0,'ЗФ':0,'ЗХ':0,'ЗЦ':0,'ЗЧ':0,'ЗШ':0,'ЗЩ':0,'ЗЫ':0,'ЗЬ':0,'ЗЭ':0,'ЗЮ':0,'ЗЯ':0,'ИА':0,'ИБ':0,'ИВ':0,'ИГ':0,'ИД':0,'ИЕ':0,'ИЖ':0,'ИЗ':0,'ИИ':0,'ИЙ':0,'ИК':0,'ИЛ':0,'ИМ':0,'ИН':0,'ИО':0,'ИП':0,'ИР':0,'ИС':0,'ИТ':0,'ИУ':0,'ИФ':0,'ИХ':0,'ИЦ':0,'ИЧ':0,'ИШ':0,'ИЩ':0,'ИЫ':0,'ИЬ':0,'ИЭ':0,'ИЮ':0,'ИЯ':0,'ЙА':0,'ЙБ':0,'ЙВ':0,'ЙГ':0,'ЙД':0,'ЙЕ':0,'ЙЖ':0,'ЙЗ':0,'ЙИ':0,'ЙЙ':0,'ЙК':0,'ЙЛ':0,'ЙМ':0,'ЙН':0,'ЙО':0,'ЙП':0,'ЙР':0,'ЙС':0,'ЙТ':0,'ЙУ':0,'ЙФ':0,'ЙХ':0,'ЙЦ':0,'ЙЧ':0,'ЙШ':0,'ЙЩ':0,'ЙЫ':0,'ЙЬ':0,'ЙЭ':0,'ЙЮ':0,'ЙЯ':0,'КА':0,'КБ':0,'КВ':0,'КГ':0,'КД':0,'КЕ':0,'КЖ':0,'КЗ':0,'КИ':0,'КЙ':0,'КК':0,'КЛ':0,'КМ':0,'КН':0,'КО':0,'КП':0,'КР':0,'КС':0,'КТ':0,'КУ':0,'КФ':0,'КХ':0,'КЦ':0,'КЧ':0,'КШ':0,'КЩ':0,'КЫ':0,'КЬ':0,'КЭ':0,'КЮ':0,'КЯ':0,'ЛА':0,'ЛБ':0,'ЛВ':0,'ЛГ':0,'ЛД':0,'ЛЕ':0,'ЛЖ':0,'ЛЗ':0,'ЛИ':0,'ЛЙ':0,'ЛК':0,'ЛЛ':0,'ЛМ':0,'ЛН':0,'ЛО':0,'ЛП':0,'ЛР':0,'ЛС':0,'ЛТ':0,'ЛУ':0,'ЛФ':0,'ЛХ':0,'ЛЦ':0,'ЛЧ':0,'ЛШ':0,'ЛЩ':0,'ЛЫ':0,'ЛЬ':0,'ЛЭ':0,'ЛЮ':0,'ЛЯ':0,'МА':0,'МБ':0,'МВ':0,'МГ':0,'МД':0,'МЕ':0,'МЖ':0,'МЗ':0,'МИ':0,'МЙ':0,'МК':0,'МЛ':0,'ММ':0,'МН':0,'МО':0,'МП':0,'МР':0,'МС':0,'МТ':0,'МУ':0,'МФ':0,'МХ':0,'МЦ':0,'МЧ':0,'МШ':0,'МЩ':0,'МЫ':0,'МЬ':0,'МЭ':0,'МЮ':0,'МЯ':0,'НА':0,'НБ':0,'НВ':0,'НГ':0,'НД':0,'НЕ':0,'НЖ':0,'НЗ':0,'НИ':0,'НЙ':0,'НК':0,'НЛ':0,'НМ':0,'НН':0,'НО':0,'НП':0,'НР':0,'НС':0,'НТ':0,'НУ':0,'НФ':0,'НХ':0,'НЦ':0,'НЧ':0,'НШ':0,'НЩ':0,'НЫ':0,'НЬ':0,'НЭ':0,'НЮ':0,'НЯ':0,'ОА':0,'ОБ':0,'ОВ':0,'ОГ':0,'ОД':0,'ОЕ':0,'ОЖ':0,'ОЗ':0,'ОИ':0,'ОЙ':0,'ОК':0,'ОЛ':0,'ОМ':0,'ОН':0,'ОО':0,'ОП':0,'ОР':0,'ОС':0,'ОТ':0,'ОУ':0,'ОФ':0,'ОХ':0,'ОЦ':0,'ОЧ':0,'ОШ':0,'ОЩ':0,'ОЫ':0,'ОЬ':0,'ОЭ':0,'ОЮ':0,'ОЯ':0,'ПА':0,'ПБ':0,'ПВ':0,'ПГ':0,'ПД':0,'ПЕ':0,'ПЖ':0,'ПЗ':0,'ПИ':0,'ПЙ':0,'ПК':0,'ПЛ':0,'ПМ':0,'ПН':0,'ПО':0,'ПП':0,'ПР':0,'ПС':0,'ПТ':0,'ПУ':0,'ПФ':0,'ПХ':0,'ПЦ':0,'ПЧ':0,'ПШ':0,'ПЩ':0,'ПЫ':0,'ПЬ':0,'ПЭ':0,'ПЮ':0,'ПЯ':0,'РА':0,'РБ':0,'РВ':0,'РГ':0,'РД':0,'РЕ':0,'РЖ':0,'РЗ':0,'РИ':0,'РЙ':0,'РК':0,'РЛ':0,'РМ':0,'РН':0,'РО':0,'РП':0,'РР':0,'РС':0,'РТ':0,'РУ':0,'РФ':0,'РХ':0,'РЦ':0,'РЧ':0,'РШ':0,'РЩ':0,'РЫ':0,'РЬ':0,'РЭ':0,'РЮ':0,'РЯ':0,'СА':0,'СБ':0,'СВ':0,'СГ':0,'СД':0,'СЕ':0,'СЖ':0,'СЗ':0,'СИ':0,'СЙ':0,'СК':0,'СЛ':0,'СМ':0,'СН':0,'СО':0,'СП':0,'СР':0,'СС':0,'СТ':0,'СУ':0,'СФ':0,'СХ':0,'СЦ':0,'СЧ':0,'СШ':0,'СЩ':0,'СЫ':0,'СЬ':0,'СЭ':0,'СЮ':0,'СЯ':0,'ТА':0,'ТБ':0,'ТВ':0,'ТГ':0,'ТД':0,'ТЕ':0,'ТЖ':0,'ТЗ':0,'ТИ':0,'ТЙ':0,'ТК':0,'ТЛ':0,'ТМ':0,'ТН':0,'ТО':0,'ТП':0,'ТР':0,'ТС':0,'ТТ':0,'ТУ':0,'ТФ':0,'ТХ':0,'ТЦ':0,'ТЧ':0,'ТШ':0,'ТЩ':0,'ТЫ':0,'ТЬ':0,'ТЭ':0,'ТЮ':0,'ТЯ':0,'УА':0,'УБ':0,'УВ':0,'УГ':0,'УД':0,'УЕ':0,'УЖ':0,'УЗ':0,'УИ':0,'УЙ':0,'УК':0,'УЛ':0,'УМ':0,'УН':0,'УО':0,'УП':0,'УР':0,'УС':0,'УТ':0,'УУ':0,'УФ':0,'УХ':0,'УЦ':0,'УЧ':0,'УШ':0,'УЩ':0,'УЫ':0,'УЬ':0,'УЭ':0,'УЮ':0,'УЯ':0,'ФА':0,'ФБ':0,'ФВ':0,'ФГ':0,'ФД':0,'ФЕ':0,'ФЖ':0,'ФЗ':0,'ФИ':0,'ФЙ':0,'ФК':0,'ФЛ':0,'ФМ':0,'ФН':0,'ФО':0,'ФП':0,'ФР':0,'ФС':0,'ФТ':0,'ФУ':0,'ФФ':0,'ФХ':0,'ФЦ':0,'ФЧ':0,'ФШ':0,'ФЩ':0,'ФЫ':0,'ФЬ':0,'ФЭ':0,'ФЮ':0,'ФЯ':0,'ХА':0,'ХБ':0,'ХВ':0,'ХГ':0,'ХД':0,'ХЕ':0,'ХЖ':0,'ХЗ':0,'ХИ':0,'ХЙ':0,'ХК':0,'ХЛ':0,'ХМ':0,'ХН':0,'ХО':0,'ХП':0,'ХР':0,'ХС':0,'ХТ':0,'ХУ':0,'ХФ':0,'ХХ':0,'ХЦ':0,'ХЧ':0,'ХШ':0,'ХЩ':0,'ХЫ':0,'ХЬ':0,'ХЭ':0,'ХЮ':0,'ХЯ':0,'ЦА':0,'ЦБ':0,'ЦВ':0,'ЦГ':0,'ЦД':0,'ЦЕ':0,'ЦЖ':0,'ЦЗ':0,'ЦИ':0,'ЦЙ':0,'ЦК':0,'ЦЛ':0,'ЦМ':0,'ЦН':0,'ЦО':0,'ЦП':0,'ЦР':0,'ЦС':0,'ЦТ':0,'ЦУ':0,'ЦФ':0,'ЦХ':0,'ЦЦ':0,'ЦЧ':0,'ЦШ':0,'ЦЩ':0,'ЦЫ':0,'ЦЬ':0,'ЦЭ':0,'ЦЮ':0,'ЦЯ':0,'ЧА':0,'ЧБ':0,'ЧВ':0,'ЧГ':0,'ЧД':0,'ЧЕ':0,'ЧЖ':0,'ЧЗ':0,'ЧИ':0,'ЧЙ':0,'ЧК':0,'ЧЛ':0,'ЧМ':0,'ЧН':0,'ЧО':0,'ЧП':0,'ЧР':0,'ЧС':0,'ЧТ':0,'ЧУ':0,'ЧФ':0,'ЧХ':0,'ЧЦ':0,'ЧЧ':0,'ЧШ':0,'ЧЩ':0,'ЧЫ':0,'ЧЬ':0,'ЧЭ':0,'ЧЮ':0,'ЧЯ':0,'ША':0,'ШБ':0,'ШВ':0,'ШГ':0,'ШД':0,'ШЕ':0,'ШЖ':0,'ШЗ':0,'ШИ':0,'ШЙ':0,'ШК':0,'ШЛ':0,'ШМ':0,'ШН':0,'ШО':0,'ШП':0,'ШР':0,'ШС':0,'ШТ':0,'ШУ':0,'ШФ':0,'ШХ':0,'ШЦ':0,'ШЧ':0,'ШШ':0,'ШЩ':0,'ШЫ':0,'ШЬ':0,'ШЭ':0,'ШЮ':0,'ШЯ':0,'ЩА':0,'ЩБ':0,'ЩВ':0,'ЩГ':0,'ЩД':0,'ЩЕ':0,'ЩЖ':0,'ЩЗ':0,'ЩИ':0,'ЩЙ':0,'ЩК':0,'ЩЛ':0,'ЩМ':0,'ЩН':0,'ЩО':0,'ЩП':0,'ЩР':0,'ЩС':0,'ЩТ':0,'ЩУ':0,'ЩФ':0,'ЩХ':0,'ЩЦ':0,'ЩЧ':0,'ЩШ':0,'ЩЩ':0,'ЩЫ':0,'ЩЬ':0,'ЩЭ':0,'ЩЮ':0,'ЩЯ':0,'ЫА':0,'ЫБ':0,'ЫВ':0,'ЫГ':0,'ЫД':0,'ЫЕ':0,'ЫЖ':0,'ЫЗ':0,'ЫИ':0,'ЫЙ':0,'ЫК':0,'ЫЛ':0,'ЫМ':0,'ЫН':0,'ЫО':0,'ЫП':0,'ЫР':0,'ЫС':0,'ЫТ':0,'ЫУ':0,'ЫФ':0,'ЫХ':0,'ЫЦ':0,'ЫЧ':0,'ЫШ':0,'ЫЩ':0,'ЫЫ':0,'ЫЬ':0,'ЫЭ':0,'ЫЮ':0,'ЫЯ':0,'ЬА':0,'ЬБ':0,'ЬВ':0,'ЬГ':0,'ЬД':0,'ЬЕ':0,'ЬЖ':0,'ЬЗ':0,'ЬИ':0,'ЬЙ':0,'ЬК':0,'ЬЛ':0,'ЬМ':0,'ЬН':0,'ЬО':0,'ЬП':0,'ЬР':0,'ЬС':0,'ЬТ':0,'ЬУ':0,'ЬФ':0,'ЬХ':0,'ЬЦ':0,'ЬЧ':0,'ЬШ':0,'ЬЩ':0,'ЬЫ':0,'ЬЬ':0,'ЬЭ':0,'ЬЮ':0,'ЬЯ':0,'ЭА':0,'ЭБ':0,'ЭВ':0,'ЭГ':0,'ЭД':0,'ЭЕ':0,'ЭЖ':0,'ЭЗ':0,'ЭИ':0,'ЭЙ':0,'ЭК':0,'ЭЛ':0,'ЭМ':0,'ЭН':0,'ЭО':0,'ЭП':0,'ЭР':0,'ЭС':0,'ЭТ':0,'ЭУ':0,'ЭФ':0,'ЭХ':0,'ЭЦ':0,'ЭЧ':0,'ЭШ':0,'ЭЩ':0,'ЭЫ':0,'ЭЬ':0,'ЭЭ':0,'ЭЮ':0,'ЭЯ':0,'ЮА':0,'ЮБ':0,'ЮВ':0,'ЮГ':0,'ЮД':0,'ЮЕ':0,'ЮЖ':0,'ЮЗ':0,'ЮИ':0,'ЮЙ':0,'ЮК':0,'ЮЛ':0,'ЮМ':0,'ЮН':0,'ЮО':0,'ЮП':0,'ЮР':0,'ЮС':0,'ЮТ':0,'ЮУ':0,'ЮФ':0,'ЮХ':0,'ЮЦ':0,'ЮЧ':0,'ЮШ':0,'ЮЩ':0,'ЮЫ':0,'ЮЬ':0,'ЮЭ':0,'ЮЮ':0,'ЮЯ':0,'ЯА':0,'ЯБ':0,'ЯВ':0,'ЯГ':0,'ЯД':0,'ЯЕ':0,'ЯЖ':0,'ЯЗ':0,'ЯИ':0,'ЯЙ':0,'ЯК':0,'ЯЛ':0,'ЯМ':0,'ЯН':0,'ЯО':0,'ЯП':0,'ЯР':0,'ЯС':0,'ЯТ':0,'ЯУ':0,'ЯФ':0,'ЯХ':0,'ЯЦ':0,'ЯЧ':0,'ЯШ':0,'ЯЩ':0,'ЯЫ':0,'ЯЬ':0,'ЯЭ':0,'ЯЮ':0,'ЯЯ':0
}

freq_rating=[
'СТ', 'НО', 'ТО',  'НА', 'ЕН', 'НЕ', 'ПО', 'ОН', 'ОТ', 'НИ', 'ОС', 'ОВ', 'КО', 'АЛ', 'РО', 'РА', 'ЛИ', 'ЛА', 'ПР', 'ЛО', 'РЕ', 'ОЛ', 'ЕР', 'КА', 'ОМ', 'ГО', 'ЕТ', 'ЕС', 'ТЬ', 'ВО', 'АН', 'ВА', 'АС', 'ТА', 'ОГ', 'ОД', 'АТ', 'ОР', 'ЕЛ', 'ИЛ', 'ЕМ', 'АК', 'ТЕ', 'ИТ', 'ЗА', 'ОБ', 'РИ', 'ВЕ', 'ИН', 'ИС', 'ДЕ', 'ДА', 'ЛЕ', 'МО', 'АВ', 'ТР', 'ЛЬ', 'НЫ', 'ИВ', 'ОП', 'ЧТ', 'ЕД', 'СЯ', 'ТИ', 'МЕ', 'ЧЕ', 'ОЙ', 'АЗ', 'АМ', 'ДО', 'МИ', 'ЕГ', 'СЬ', 'ЖЕ', 'СЕ', 'БЫ', 'СЛ', 'ИМ', 'НН', 'СК', 'ОК', 'ЕВ', 'ВИ', 'ИК', 'ЕП', 'ВС', 'ИЕ', 'ТВ', 'ИЗ', 'ОЧ', 'СО', 'КИ', 'ЭТ', 'МА', 'ЬН', 'АП', 'ДИ', 'НУ', 'ОЕ', 'ЕК', 'ЕЙ', 'АД', 'ЬС', 'ХО', 'ПЕ', 'АЯ', 'ИД', 'РУ', 'ОЖ', 'ИП', 'БО', 'СП', 'ОЗ', 'МУ', 'АР', 'ВЫ', 'ЕБ', 'ИИ', 'МН', 'НТ', 'ИХ', 'АЕ', 'ОО', 'ЕЗ', 'ИЯ', 'ЗН', 'КУ', 'ВН', 'ОИ', 'ЕЕ', 'ИР', 'ТЫ', 'УТ', 'ШЕ', 'КР', 'ЩЕ', 'ЯН', 'ДН', 'ТС', 'ЧА', 'УД', 'ИО', 'ТН', 'ЛЯ', 'СИ', 'БЕ', 'УС', 'ЫЛ', 'ЕО', 'ГР', 'ИЧ', 'ЫВ', 'ЕЧ', 'ЯВ', 'ЯТ', 'ЫМ', 'СА', 'ЛС', 'ЬК', 'ТУ', 'СВ', 'УЛ', 'ЯС', 'АБ', 'БИ', 'ЧИ', 'ШИ', 'АЧ', 'ГЛ', 'ЙС', 'РЫ', 'СН', 'УЖ', 'ЫЕ', 'ПА', 'ЖИ', 'ЬВ', 'ЫЙ', 'ЛУ', 'ЕИ', 'НЯ', 'ДУ', 'ЕШ', 'АО', 'АЖ', 'МЫ', 'БР', 'УЧ', 'КТ', 'АИ', 'ЫХ', 'ЫС', 'ЖН', 'ГА', 'УВ', 'ИЦ', 'ЯП', 'УН', 'РН', 'ЗО', 'ГД', 'УП', 'ШЬ', 'АХ', 'УГ', 'УК', 'ЯК', 'УМ', 'ЯД', 'ВР', 'УЮ', 'ИБ', 'ЬП', 'ЫТ', 'КС', 'ЖА', 'ЗВ', 'ЗД', 'ЩИ', 'МП', 'АГ', 'ТК', 'АЮ', 'РЯ', 'ПИ', 'ИЙ', 'ЦИ', 'ЕЖ', 'ДР', 'АУ', 'ЧН', 'ОЯ', 'СМ', 'ИШ', 'ЯЛ', 'ДВ', 'УР', 'ВЛ', 'МС', 'ВП', 'ПЛ', 'ЙН', 'ЛЮ', 'ИГ', 'ЬИ', 'ВШ', 'БУ', 'ЬО', 'ЦЕ', 'СС', 'ЛН', 'СУ', 'ПУ', 'УИ', 'ВК', 'ЙП', 'ЯО', 'ЕЩ', 'ЖД', 'ЬЕ', 'ГИ', 'БА', 'ЮЩ', 'ОШ', 'ЯМ', 'ЫП', 'ЫН', 'ВУ', 'БЛ', 'ЯИ', 'ОХ', 'КЕ', 'НС', 'КЛ', 'ВТ', 'ТП', 'КН', 'ША', 'АШ', 'ЬШ', 'УШ', 'ЕУ', 'ДЛ', 'ЯЗ', 'МВ', 'ДЫ', 'УБ', 'ШК', 'ЬТ', 'НЬ', 'ЛК', 'ЙВ', 'ЧУ', 'ОУ', 'ВЗ', 'ТБ', 'ВД', 'ЙТ', 'ЛЫ', 'ЦА', 'ЗМ', 'РТ', 'ЕХ', 'ЬЧ', 'ТЯ', 'МК', 'МЯ', 'ЮТ', 'ЬМ', 'ЯЧ', 'ШЛ', 'БЯ', 'ЙИ', 'ДС', 'ОЭ', 'ЮД', 'ГУ', 'ПЫ', 'РЬ', 'ЗИ', 'ЙК', 'ЗЕ', 'ЬЗ', 'УЩ', 'КВ', 'ЫИ', 'ЬД', 'ЙО', 'ХН', 'ЗУ', 'АЙ', 'ФО', 'ЩА', 'НК', 'ИЖ', 'РВ', 'ЬЮ', 'ЫШ', 'ИУ', 'ИА', 'ХС', 'ЗЫ', 'АФ', 'ХВ', 'МТ', 'УХ', 'ЗГ', 'МД', 'МЧ', 'ЙД', 'ХП', 'ЛЧ', 'ЙМ', 'ЗР', 'СЧ', 'ЯБ', 'ХИ', 'ГН', 'ТТ', 'ЫБ', 'ТЧ', 'ТД', 'ЛП', 'ЯЕ', 'СЫ', 'ЛВ', 'ЫО', 'ЫД', 'УО', 'ЬЯ', 'ШН', 'УЗ', 'СР', 'НП', 'ВВ', 'СД', 'ВМ', 'АЩ', 'ЭК', 'ОЩ', 'АЭ', 'ЫР', 'ЫК', 'ЬБ', 'ДК', 'ЧК', 'ИЮ', 'АЦ', 'ГЕ', 'ДТ', 'ЯР', 'ТЛ', 'ЛЖ', 'ДЯ', 'МЛ', 'ЕА', 'НД', 'ММ', 'РК', 'КП', 'ДЬ', 'РМ', 'ЮС', 'ЕЭ', 'ИЭ', 'ХА', 'ФИ', 'ЯЩ', 'ЙЧ', 'ЗК', 'МБ', 'ЕЯ', 'НВ', 'РЖ', 'ЯУ', 'ВГ', 'ТМ', 'БН', 'РС', 'ЬУ', 'ЮЖ', 'ЗЛ', 'ЙР', 'ВЯ', 'ЙЗ', 'ЕЦ', 'ЯГ', 'УЕ', 'ЬЭ', 'ЛЛ', 'ЧЬ', 'ЖУ', 'ЩУ', 'ЬР', 'ЯХ', 'ХР', 'ЛТ', 'ЮБ', 'ХК', 'ЬЛ', 'ЫЧ', 'НР', 'ЮП', 'ЮК', 'ЛГ', 'ЙБ', 'ЫГ', 'ЮН', 'ЫЗ', 'ЮЧ', 'ДЖ', 'ВЭ', 'ВБ', 'ЯЖ', 'ХЛ', 'НЧ', 'МР', 'КМ', 'ЬГ', 'НЦ', 'ЗБ', 'КБ', 'ХД', 'КК', 'ХУ', 'РХ', 'МЗ', 'ЦЫ', 'МГ', 'КЧ', 'СХ', 'РГ', 'БС', 'ОА', 'БЩ', 'ФА', 'ЯЯ', 'РД', 'ПС', 'ЮВ', 'УА', 'ДП', 'ЦО', 'ЙГ', 'ПН', 'ЮИ', 'ЯЭ', 'ДЦ', 'ОЦ', 'РП', 'ЙЛ', 'ЙЭ', 'ВЧ', 'ОФ', 'ЗП', 'ХТ', 'СБ', 'ЛБ', 'ХМ', 'ЛМ', 'ЮО', 'АА', 'ШО', 'ЗЯ', 'ИЩ', 'ЗЬ', 'СЮ', 'УЯ', 'НЗ', 'РШ', 'КД', 'ЛД', 'ШУ', 'ПЯ', 'ЙУ', 'ЯЮ', 'ЦУ', 'ФЕ', 'ЮЗ', 'ЫУ', 'ТЗ', 'ЗС', 'ТЭ', 'ПК', 'ЛЗ', 'ВЬ', 'НЮ', 'НБ', 'СГ', 'ПТ', 'ГК', 'ЬА', 'ЙА', 'ИФ', 'ЗЗ', 'РЛ', 'ЕФ', 'ЙШ', 'ЮМ', 'ОЮ', 'ЯА', 'КЗ', 'ХБ', 'УУ', 'БК', 'РР', 'ЗТ', 'СЭ', 'РЮ', 'БЬ', 'КЦ', 'ЖК', 'ХЕ', 'ЫЭ', 'ГВ', 'ЮР', 'ЬЦ', 'УЙ', 'ГП', 'ЬХ', 'ХЗ', 'ВХ', 'ЧШ', 'РЧ', 'КГ', 'ЯЦ', 'ЦВ', 'ЕЮ', 'ТГ', 'МЭ', 'ЙЕ', 'СШ', 'ЙЖ', 'ЫЯ', 'КЭ', 'ЖО', 'ТЖ', 'КЖ', 'УЭ', 'ДЧ', 'МЖ', 'ФУ', 'ПП', 'НГ', 'ЛЭ', 'ДД', 'ГС', 'БЭ', 'ХЧ', 'СЦ', 'МХ', 'ЛР', 'ЫЖ', 'ЗЖ', 'ФР', 'СЗ', 'ЩН', 'ШТ', 'НФ', 'ДГ', 'НМ', 'ДМ', 'ВЮ', 'ТЦ', 'ДШ', 'ЖЬ', 'ЧО', 'ХГ', 'ВЦ', 'ГЧ', 'ЬЖ', 'ЧЛ', 'ЮГ', 'РБ', 'ЙХ', 'ЙЯ', 'ЮЭ', 'НЩ', 'СФ', 'ЮЕ', 'ТЮ', 'МФ', 'ЙФ', 'ДБ', 'ЫА', 'ХЭ', 'МЬ', 'ЗЭ', 'ЙЦ', 'ГБ', 'БХ', 'ДХ', 'ЯШ', 'ЮА', 'КЯ', 'ЗЧ', 'РЗ', 'ПЬ', 'ЗЦ', 'ГТ', 'ГМ', 'ЮУ', 'ЭЛ', 'ХШ', 'СЖ', 'РЦ', 'ДЗ', 'ВФ', 'БШ', 'ЩЬ', 'ФЛ', 'ХЖ', 'ТХ', 'БВ', 'ЭН', 'ТШ', 'ВЖ', 'ЯФ', 'ЮЮ', 'ЮЛ', 'РЩ', 'ЖЧ', 'ШМ', 'КШ', 'БП', 'ЮЯ', 'ЬФ', 'ЦК', 'ХЯ', 'НЭ', 'НЛ', 'ДЮ', 'БМ', 'ШП', 'ХФ', 'ТФ', 'МШ', 'ЛХ', 'ЖБ', 'ЮХ', 'ЭМ', 'ЦС', 'ЭД', 'ШВ', 'УФ', 'ТЩ', 'НХ', 'ЮФ', 'ЭВ', 'ЦП', 'ЛШ', 'ГЗ', 'ФЫ', 'РЭ', 'НЖ', 'МЦ', 'ЮШ', 'ЭФ', 'ЫЩ', 'ЧВ', 'ФФ', 'ФС', 'ФП', 'ЖВ', 'ГГ', 'БД', 'ЮЦ', 'ЭР', 'ЖС', 'ДЭ', 'БЖ', 'ЭП', 'ЩР', 'ЦН', 'ФТ', 'ФН', 'ЗШ', 'ЖП', 'ЯЙ', 'ЧР', 'НШ', 'КХ', 'ЖТ', 'ЦР', 'ЦД', 'ХЦ', 'ПЧ', 'ЛФ', 'ЖГ', 'ГЭ', 'БТ', 'ЦМ', 'ХХ', 'УЦ', 'КЮ', 'ЙЮ', 'ШР', 'ЦТ', 'ЦБ', 'ФК', 'МЮ', 'ЛЦ', 'КФ', 'ЗФ', 'ЖЛ', 'ЭХ', 'ЫЦ', 'ФВ', 'ЖЯ', 'ВЩ', 'БГ', 'ЮЙ', 'ЭС', 'ЬЩ', 'ШД', 'ШБ', 'ХЬ', 'ФЗ', 'ПД', 'ЛЩ', 'ЙЩ', 'ЗЮ', 'ЖМ', 'ЖЖ', 'ГШ', 'БЗ', 'ЦЯ', 'ЦГ', 'ФБ', 'РФ', 'ПЮ', 'ПМ', 'МЩ', 'ЖР', 'ЖЗ', 'ДФ', 'ГЯ', 'ББ', 'ЭЙ', 'ЫФ', 'ШЦ', 'ШС', 'ЧФ', 'ЦЗ', 'ПВ', 'ЗХ', 'ЖЭ', 'ЖХ', 'ГХ', 'БЮ', 'ЭЗ', 'ЭГ', 'ЫЮ', 'ЩВ', 'ЧС', 'ЧЗ', 'ЦЧ', 'ЦЛ', 'ХЮ', 'ФМ', 'СЩ', 'ПШ', 'БЧ', 'ЭШ', 'ЭУ', 'ЫЫ', 'ЩП', 'ЩО', 'ЩД', 'ШЧ', 'ШГ', 'ЧЧ', 'ЧХ', 'ЧП', 'ЧД', 'ЦЭ', 'ЦХ', 'ХЩ', 'ФЭ', 'ФЬ', 'ФХ', 'ФД', 'ФГ', 'ПЭ', 'ПЗ', 'ГЮ', 'ГФ', 'ГЖ', 'ЯЬ', 'ЯЫ', 'ЮЬ', 'ЮЫ', 'ЭЯ', 'ЭЮ', 'ЭЭ', 'ЭЬ', 'ЭЫ', 'ЭЩ', 'ЭЧ', 'ЭЦ', 'ЭО', 'ЭИ', 'ЭЖ', 'ЭЕ', 'ЭБ', 'ЭА', 'ЬЬ', 'ЬЫ', 'ЬЙ', 'ЫЬ', 'ЩЯ', 'ЩЮ', 'ЩЭ', 'ЩЫ', 'ЩЩ', 'ЩШ', 'ЩЧ', 'ЩЦ', 'ЩХ', 'ЩФ', 'ЩТ', 'ЩС', 'ЩМ', 'ЩЛ', 'ЩК', 'ЩЙ', 'ЩЗ', 'ЩЖ', 'ЩГ', 'ЩБ', 'ШЯ', 'ШЮ', 'ШЭ', 'ШЫ', 'ШЩ', 'ШШ', 'ШХ', 'ШФ', 'ШЙ', 'ШЗ', 'ШЖ', 'ЧЯ', 'ЧЮ', 'ЧЭ', 'ЧЫ', 'ЧЩ', 'ЧЦ', 'ЧМ', 'ЧЙ', 'ЧЖ', 'ЧГ', 'ЧБ', 'ЦЮ', 'ЦЬ', 'ЦЩ', 'ЦШ', 'ЦЦ', 'ЦФ', 'ЦЙ', 'ЦЖ', 'ХЫ', 'ХЙ', 'ФЯ', 'ФЮ', 'ФЩ', 'ФШ', 'ФЧ', 'ФЦ', 'ФЙ', 'ФЖ', 'УЬ', 'УЫ', 'ТЙ', 'СЙ', 'РЙ', 'ПЩ', 'ПЦ', 'ПХ', 'ПФ', 'ПЙ', 'ПЖ', 'ПГ', 'ПБ', 'ОЬ', 'ОЫ', 'НЙ', 'МЙ', 'ЛЙ', 'КЬ', 'КЫ', 'КЩ', 'КЙ', 'ЙЬ', 'ЙЫ', 'ЙЙ', 'ИЬ', 'ИЫ', 'ЗЩ', 'ЗЙ', 'ЖЮ', 'ЖЫ', 'ЖЩ', 'ЖШ', 'ЖЦ', 'ЖФ', 'ЖЙ', 'ЕЬ', 'ЕЫ', 'ДЩ', 'ДЙ', 'ГЬ', 'ГЫ', 'ГЩ', 'ГЦ', 'ГЙ', 'ВЙ', 'БЦ', 'БФ', 'БЙ', 'АЬ', 'АЫ'
]

def get_counts_in_text(text):
       cur_counts = char_counts.copy()
       for char in text:
              cur_counts[char.upper()]+=1
       return cur_counts
def get_counts_of_bigramms(text):
       cur_counts=couple_counts.copy()
       for i in range(0,len(text),2):
              cur_counts[text[i]+text[i+1]]+=1
       return cur_counts

def calculate_INDEX(text):
       cur_counts = get_counts_in_text(text)
       summ=0
       for i in cur_counts:
              summ+=cur_counts[i]*(cur_counts[i]-1)
       INDEX=summ*1.0/(len(text)*(len(text)-1))
       return INDEX

def filter_raw_text(f_name):
       global alphabet
       raw_text = codecs.open( f_name, "r", "utf-8" ).read()
       filtered_text=''
       for char_t in raw_text:
              if char_t in alphabet.keys():
                     filtered_text+=char(num(char_t)).lower()
       return filtered_text

       
